bubbleColumn/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 2e+06;

boundaryField
{
    sideLeft
    {
        type            zeroGradient;
    }
    sideRight
    {
        type            fixedValue;
        value           uniform 2e+06;
    }
    topbottom
    {
        type            empty;
    }
    frontback
    {
        type            empty;
    }
}


// ************************************************************************* //
